package ru.gb.timesheet.hw;

public class Homework {

  // 1. Подключить сваггер к своему проекту (который мы делаем, т.е. с проектами,
  // таймшитами и тд)
  // (подключить в Pom.xml
  // <artifactId>springdoc-openapi-starter-webmvc-ui</artifactId>).
  // 2. Добавить описание ручек (название на русском языке + описание, что делают)
  // 3. ** Описать параметры и возвращаемые типы данных.

  // В качестве домашки прислать скриншот(ы) OpenAPI-страницы (которая красивая).
  // Не нужно присылать 10+ скриншотов, достаточно тех, по которым понятно, что
  // работа сделана.

}
